# PhotometricWebLightDistribution Constructor (PhotometricWebLightDistribution)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhotometricWebLightDistribution Constructor (PhotometricWebLightDistribution)
PhotometricWebLightDistribution Class See Also
---
Creates a copy of the given photometric web light distribution
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public PhotometricWebLightDistribution(
	PhotometricWebLightDistribution other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As PhotometricWebLightDistribution _
)
```

Visual C++
---
```text
public:
PhotometricWebLightDistribution(
	PhotometricWebLightDistribution^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Lighting..::..PhotometricWebLightDistribution
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PhotometricWebLightDistribution Class
PhotometricWebLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace